"""Придумать какой-нибудь случай, где выгоднее использовать реляционную базу данных,
а где нереляционную базу данных."""

"""1. Компания, занимающаяся онлайн-ритейлом и имеющая множество клиентов, заказов и товаров.
В этом случае следует использовать реляционную базу данных для управления сложными отношениями между 
клиентами, заказами и товарами, обеспечения целостности и консистентности данных."""


"""2. Социальная сеть с огромным количеством пользователей, которые имеют множество связей 
с другими пользователями, публикуют посты, комментарии и т. д. В данном случае использование
графовой базы данных (нереляционной) будет более выгодным, так как она позволяет эффективно
моделировать и обрабатывать сложные связи между пользователями."""


"""3. Интернет-магазин с простой структурой данных, не требующий сложных связей и транзакций. 
В данном случае можно использовать нереляционную базу данных, такую как документоориентированная 
или ключ-значение, чтобы обеспечить простоту и скорость доступа к данным без необходимости связывания
их с другими объектами."""


"""4. Веб-аналитика, где требуется обработка и анализ больших объемов данных. Здесь нереляционная
база данных, такая как колоночная или база данных на основе хранилища данных, будет предпочтительнее,
так как она может обеспечить высокую производительность при агрегации данных и выполнении сложных запросов."""


"""5. Платформа для сбора и хранения данных датчиков Интернета вещей (IoT). В этом случае использование
нереляционной базы данных, такой как временные ряды, позволит эффективно обрабатывать и хранить большие 
объемы временных данных от множества датчиков без избыточности информации."""


